yingsanyi/SparkBot_pro/LCD_face_voice_control/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHMODE_DIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_FETCH_INSTRUCTIONS=y
CONFIG_SPIRAM_RODATA=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=64
CONFIG_SPIRAM_ALLOW_BSS_SEG_EXTERNAL_MEMORY=y
CONFIG_SPIRAM_ALLOW_NOINIT_SEG_EXTERNAL_MEMORY=y

CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_TIMER_TASK_STACK_DEPTH=4096
CONFIG_LIBC_NEWLIB_NANO_FORMAT=y

CONFIG_USE_MULTINET=y
CONFIG_SR_WN_WN9_HILEXIN=y
CONFIG_SR_MN_CN_MULTINET7_QUANT=y
CONFIG_SR_MN_EN_NONE=y

CONFIG_CODEC_ES8311_SUPPORT=y
CONFIG_SPARKBOT_AUDIO_I2C_NUM=0
CONFIG_SPARKBOT_AUDIO_I2S_NUM=0
CONFIG_LCD_FACE_VOICE_MIC_GAIN=30
CONFIG_LCD_FACE_VOICE_WAKE_MODE_90=y
CONFIG_LCD_FACE_VOICE_COMMAND_TIMEOUT_MS=5760
CONFIG_LCD_FACE_VOICE_MN_THRESHOLD_PERCENT=0
